; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p0-2 - location
	p0-4 - location
	p1-2 - location
	p1-3 - location
	p1-6 - location
	p1-9 - location
	p2-4 - location
	p3-0 - location
	p4-0 - location
	p5-7 - location
	p6-8 - location
	p7-1 - location
	p7-2 - location
	p7-4 - location
	p7-6 - location
	p8-7 - location
	p9-5 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s1)
	(at driver3 s6)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s9)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s6)
	(at package2 s4)
	(at package3 s9)
	(at package4 s0)
	(at package5 s2)
	(at package6 s7)
	(at package7 s5)
	(at package8 s3)
	(at package9 s5)
	(at package10 s6)
	(at package11 s4)
	(at package12 s8)
	(at package13 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 59)
	(= (time-to-drive s3 s0) 59)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 46)
	(= (time-to-drive s5 s0) 46)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 82)
	(= (time-to-drive s8 s0) 82)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 43)
	(= (time-to-drive s2 s1) 43)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 97)
	(= (time-to-drive s7 s1) 97)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 85)
	(= (time-to-drive s9 s1) 85)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 74)
	(= (time-to-drive s0 s2) 74)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 1)
	(= (time-to-drive s9 s3) 1)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 97)
	(= (time-to-drive s1 s4) 97)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 32)
	(= (time-to-drive s2 s4) 32)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 35)
	(= (time-to-drive s4 s5) 35)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 87)
	(= (time-to-drive s8 s5) 87)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 56)
	(= (time-to-drive s1 s6) 56)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 23)
	(= (time-to-drive s9 s6) 23)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 33)
	(= (time-to-drive s0 s7) 33)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 71)
	(= (time-to-drive s2 s7) 71)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 72)
	(= (time-to-drive s5 s7) 72)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 30)
	(= (time-to-drive s6 s7) 30)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 28)
	(= (time-to-drive s9 s7) 28)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 69)
	(= (time-to-drive s4 s8) 69)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 41)
	(= (time-to-drive s6 s8) 41)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 19)
	(= (time-to-drive s9 s8) 19)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 47)
	(= (time-to-drive s0 s9) 47)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 5)
	(= (time-to-drive s2 s9) 5)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s6)
	(at driver3 s8)
	(at truck3 s4)
	(at package1 s9)
	(at package2 s2)
	(at package3 s8)
	(at package4 s8)
	(at package5 s2)
	(at package6 s4)
	(at package7 s1)
	(at package8 s7)
	(at package9 s5)
	(at package10 s5)
	(at package11 s1)
	(at package12 s5)
	(at package13 s5)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver3 truck1 s6)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 17
2. (load-truck package1 truck1 s6)
   deleted: (at package1 s6)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 17
3. (load-truck package10 truck1 s6)
   deleted: (at package10 s6)
   added: (in package10 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 17
4. (drive-truck truck1 s6 s9 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (fuel-used) from 0 to 299
   goals met: 2 of 17
5. (walk driver2 s1 p1-6)
   deleted: (at driver2 s1)
   added: (at driver2 p1-6)
   goals met: 2 of 17
6. (walk driver2 p1-6 s6)
   deleted: (at driver2 p1-6)
   added: (at driver2 s6)
   goals met: 3 of 17
7. (unload-truck package1 truck1 s9)
   deleted: (in package1 truck1)
   added: (at package1 s9)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 17
8. (load-truck package3 truck1 s9)
   deleted: (at package3 s9)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 17
9. (walk driver1 s4 p7-4)
   deleted: (at driver1 s4)
   added: (at driver1 p7-4)
   goals met: 4 of 17
10. (drive-truck truck1 s9 s3 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s3)
   changed: (fuel-used) from 299 to 312
   goals met: 4 of 17
11. (load-truck package8 truck1 s3)
   deleted: (at package8 s3)
   added: (in package8 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 4 of 17
12. (drive-truck truck1 s3 s0 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 312 to 1256
   goals met: 4 of 17
13. (load-truck package13 truck1 s0)
   deleted: (at package13 s0)
   added: (in package13 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 4 of 17
14. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 4 of 17
15. (drive-truck truck1 s0 s9 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s9)
   changed: (fuel-used) from 1256 to 2431
   goals met: 4 of 17
16. (walk driver1 p7-4 s7)
   deleted: (at driver1 p7-4)
   added: (at driver1 s7)
   goals met: 4 of 17
17. (walk driver1 s7 p7-6)
   deleted: (at driver1 s7)
   added: (at driver1 p7-6)
   goals met: 4 of 17
18. (walk driver1 p7-6 s6)
   deleted: (at driver1 p7-6)
   added: (at driver1 s6)
   goals met: 5 of 17
19. (drive-truck truck1 s9 s8 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (fuel-used) from 2431 to 2906
   goals met: 5 of 17
20. (load-truck package12 truck1 s8)
   deleted: (at package12 s8)
   added: (in package12 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 5 of 17
21. (unload-truck package3 truck1 s8)
   deleted: (in package3 truck1)
   added: (at package3 s8)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 6 of 17
22. (unload-truck package4 truck1 s8)
   deleted: (in package4 truck1)
   added: (at package4 s8)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 7 of 17
23. (drive-truck truck1 s8 s5 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (fuel-used) from 2906 to 4646
   goals met: 7 of 17
24. (unload-truck package12 truck1 s5)
   deleted: (in package12 truck1)
   added: (at package12 s5)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 8 of 17
25. (drive-truck truck1 s5 s7 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (fuel-used) from 4646 to 5798
   goals met: 8 of 17
26. (unload-truck package8 truck1 s7)
   deleted: (in package8 truck1)
   added: (at package8 s7)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 9 of 17
27. (load-truck package6 truck1 s7)
   deleted: (at package6 s7)
   added: (in package6 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 9 of 17
28. (drive-truck truck1 s7 s9 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s9)
   changed: (fuel-used) from 5798 to 6246
   goals met: 9 of 17
29. (drive-truck truck1 s9 s8 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (fuel-used) from 6246 to 6550
   goals met: 9 of 17
30. (drive-truck truck1 s8 s4 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   changed: (fuel-used) from 6550 to 7654
   goals met: 9 of 17
31. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 10 of 17
32. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 10 of 17
33. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 7654 to 8166
   goals met: 10 of 17
34. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 11 of 17
35. (drive-truck truck1 s2 s9 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (fuel-used) from 8166 to 8231
   goals met: 11 of 17
36. (disembark-truck driver3 truck1 s9)
   deleted: (driving driver3 truck1)
   added: (at driver3 s9) (empty truck1)
   goals met: 11 of 17
37. (board-truck driver3 truck3 s9)
   deleted: (at driver3 s9) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 11 of 17
38. (drive-truck truck3 s9 s1 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   changed: (fuel-used) from 8231 to 9081
   goals met: 11 of 17
39. (drive-truck truck3 s1 s4 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 9081 to 10051
   goals met: 12 of 17
40. (load-truck package11 truck3 s4)
   deleted: (at package11 s4)
   added: (in package11 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 12 of 17
41. (unload-truck package13 truck1 s9)
   deleted: (in package13 truck1)
   added: (at package13 s9)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 12 of 17
42. (unload-truck package10 truck1 s9)
   deleted: (in package10 truck1)
   added: (at package10 s9)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 12 of 17
43. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 10051 to 11118
   goals met: 11 of 17
44. (drive-truck truck3 s1 s9 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   changed: (fuel-used) from 11118 to 12053
   goals met: 11 of 17
45. (load-truck package10 truck3 s9)
   deleted: (at package10 s9)
   added: (in package10 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 11 of 17
46. (load-truck package13 truck3 s9)
   deleted: (at package13 s9)
   added: (in package13 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 11 of 17
47. (drive-truck truck3 s9 s8 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (fuel-used) from 12053 to 12357
   goals met: 11 of 17
48. (drive-truck truck3 s8 s5 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s5)
   changed: (fuel-used) from 12357 to 13749
   goals met: 11 of 17
49. (unload-truck package13 truck3 s5)
   deleted: (in package13 truck3)
   added: (at package13 s5)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 12 of 17
50. (load-truck package7 truck3 s5)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 12 of 17
51. (drive-truck truck3 s5 s4 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 13749 to 14309
   goals met: 13 of 17
52. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 14309 to 15861
   goals met: 12 of 17
53. (unload-truck package11 truck3 s1)
   deleted: (in package11 truck3)
   added: (at package11 s1)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 13 of 17
54. (unload-truck package7 truck3 s1)
   deleted: (in package7 truck3)
   added: (at package7 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 14 of 17
55. (drive-truck truck3 s1 s7 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 15861 to 16928
   goals met: 14 of 17
56. (disembark-truck driver3 truck3 s7)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 14 of 17
57. (unload-truck package10 truck3 s7)
   deleted: (in package10 truck3)
   added: (at package10 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 14 of 17
58. (walk driver3 s7 p8-7)
   deleted: (at driver3 s7)
   added: (at driver3 p8-7)
   goals met: 14 of 17
59. (walk driver1 s6 p7-6)
   deleted: (at driver1 s6)
   added: (at driver1 p7-6)
   goals met: 13 of 17
60. (load-truck package10 truck3 s7)
   deleted: (at package10 s7)
   added: (in package10 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 13 of 17
61. (walk driver1 p7-6 s7)
   deleted: (at driver1 p7-6)
   added: (at driver1 s7)
   goals met: 13 of 17
62. (walk driver3 p8-7 s8)
   deleted: (at driver3 p8-7)
   added: (at driver3 s8)
   goals met: 14 of 17
63. (unload-truck package10 truck3 s7)
   deleted: (in package10 truck3)
   added: (at package10 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 14 of 17
64. (load-truck package10 truck2 s7)
   deleted: (at package10 s7)
   added: (in package10 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 14 of 17
65. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 14 of 17
66. (drive-truck truck2 s7 s5 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 16928 to 17720
   goals met: 14 of 17
67. (unload-truck package10 truck2 s5)
   deleted: (in package10 truck2)
   added: (at package10 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 15 of 17
68. (drive-truck truck2 s5 s7 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 17720 to 18440
   goals met: 15 of 17
69. (drive-truck truck2 s7 s6 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s6)
   changed: (fuel-used) from 18440 to 18740
   goals met: 15 of 17
70. (walk driver3 s8 p8-7)
   deleted: (at driver3 s8)
   added: (at driver3 p8-7)
   goals met: 14 of 17
71. (walk driver3 p8-7 s7)
   deleted: (at driver3 p8-7)
   added: (at driver3 s7)
   goals met: 14 of 17
72. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 14 of 17
73. (drive-truck truck3 s7 s2 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (fuel-used) from 18740 to 19450
   goals met: 14 of 17
74. (drive-truck truck3 s2 s9 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (fuel-used) from 19450 to 19500
   goals met: 14 of 17
75. (drive-truck truck3 s9 s1 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   changed: (fuel-used) from 19500 to 20350
   goals met: 14 of 17
76. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 14 of 17
77. (drive-truck truck2 s6 s8 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   changed: (fuel-used) from 20350 to 20760
   goals met: 14 of 17
78. (walk driver3 s1 p1-6)
   deleted: (at driver3 s1)
   added: (at driver3 p1-6)
   goals met: 14 of 17
79. (walk driver3 p1-6 s6)
   deleted: (at driver3 p1-6)
   added: (at driver3 s6)
   goals met: 14 of 17
80. (walk driver3 s6 p6-8)
   deleted: (at driver3 s6)
   added: (at driver3 p6-8)
   goals met: 14 of 17
81. (walk driver3 p6-8 s8)
   deleted: (at driver3 p6-8)
   added: (at driver3 s8)
   goals met: 15 of 17
82. (walk driver2 s6 p1-6)
   deleted: (at driver2 s6)
   added: (at driver2 p1-6)
   goals met: 14 of 17
83. (walk driver2 p1-6 s1)
   deleted: (at driver2 p1-6)
   added: (at driver2 s1)
   goals met: 14 of 17
84. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 14 of 17
85. (drive-truck truck3 s1 s4 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 20760 to 21730
   goals met: 15 of 17
86. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 15 of 17
87. (drive-truck truck2 s8 s6 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   changed: (fuel-used) from 21730 to 22140
   goals met: 15 of 17
88. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 16 of 17
89. (walk driver2 s4 p7-4)
   deleted: (at driver2 s4)
   added: (at driver2 p7-4)
   goals met: 16 of 17
90. (walk driver2 p7-4 s7)
   deleted: (at driver2 p7-4)
   added: (at driver2 s7)
   goals met: 16 of 17
91. (walk driver2 s7 p7-6)
   deleted: (at driver2 s7)
   added: (at driver2 p7-6)
   goals met: 16 of 17
92. (walk driver2 p7-6 s6)
   deleted: (at driver2 p7-6)
   added: (at driver2 s6)
   goals met: 17 of 17
